{
  "summary": "Builder and technical leader serving as SVP of Software Engineering at Trilogy, leading an independent department of 30-40 people. Products span education (Alpha School's AI tutoring platform enabling thousands of students to achieve 99th percentile results), recruiting (Crossover platform processing hundreds of thousands of monthly visitors), and sales (Trilogy Sales Platform managing thousands of semi-automated contract renewals across 200+ products, hundreds of millions in ARR).\n\nPlayer-coach approach: combine strategic leadership with hands-on execution as product manager, architect, and full-stack engineer. Known for building both technical systems and high-performing teams. Prior experience: 6+ years as Lead Software Engineer at msg systems, recognized as SAP Developer Hero.",
  "achievements": [
    "Shipped TimeBack (Alpha School's AI tutoring platform) from concept to production as product manager, architect, and full-stack engineer, enabling thousands of students to achieve 99th percentile test results.",
    "Built and extended Crossover hiring platform processing hundreds of thousands of monthly visitors and tens of thousands of applications, implementing AI-powered screening and assessment grading.",
    "Led strategic AI adoption across organization during 2024, achieving productivity gains while industry-wide metrics declined.",
    "Reduced cloud infrastructure costs by 50% and outages by 5x for $20M ARR SaaS product (Playbooks)."
  ],
  "skillGroups": [
    {
      "category": "Technical Leadership",
      "skills": "Architecture, Code Review, Technical Decision-Making, Team Mentoring, Process Design"
    },
    {
      "category": "Management",
      "skills": "Hiring, Performance Reviews, Budget Management, Strategic Planning, Stakeholder Management"
    },
    {
      "category": "Technologies",
      "skills": "TypeScript, Java, NodeJS, React, Spring Boot, Unity, AWS (Lambda, AppSync, DynamoDB, RDS), GraphQL, Salesforce"
    },
    {
      "category": "Specializations",
      "skills": "Cloud-Native Architectures, AI/ML Integration, Serverless, DevOps, Cost Optimization"
    }
  ]
}

